const about_me = [
      {
            id: 1,
            title: "👋 سلام! من مرتضی هستم",
            inner_title: "",
            list_items: [],
            description: "یه برنامه‌نویس فرانت‌اند با علاقه‌ی شدید به ساخت تجربه‌های بصری منظم، سریع و تمیز. با Next.js، React، TypeScript و CSS Module کار می‌کنم و همیشه دنبال اینم که هم از نظر فنی بهتر بشم، هم از نظر انسانی بالغ‌تر.",
      },
      {
            id: 2,
            title: "🧭 چطور وارد دنیای برنامه‌نویسی شدم؟",
            inner_title: "",
            list_items: [],
            description: "از اول آدم کنجکاوی بودم؛ همیشه علاقه داشتم بدونم پشت اپلیکیشن‌ها چی می‌گذره. این کنجکاوی باعث شد وارد دنیای وب بشم و از همون اول با HTML، CSS و جاوااسکریپت مسیرم رو شروع کنم. کم‌کم با React و بعدش Next.js آشنا شدم و به‌شدت جذب ساختارمندی و قدرتشون شدم.",
      },
      {
            id: 3,
            title: "🚀 الان کجای مسیرم هستم؟",
            inner_title: "الان دارم روی مهارت‌های فرانت‌اندم متمرکز کار می‌کنم، مخصوصاً روی پروژه‌های واقعی، ساخت پورتفولیو حرفه‌ای، و کار با ابزارهایی مثل:",
            list_items: [
                  "React & Next.js",
                  "CSS Module و Tailwind",
                  "Git & GitHub",
                  "TypeScript (در حال یادگیری عمیق‌تر)",
                  "تجربه با UI/UX و نوشتن کد تمیز و قابل نگهداری"
            ],
            description: "",
      },
      {
            id: 4,
            title: "🎯 هدف‌هام چیه؟",
            inner_title: "اهدافی که به نظرم کمک کننده هستند تا در مسیر بهتر بشم:",
            list_items: [
                  "تبدیل شدن به یک توسعه‌دهنده حرفه‌ای که نه فقط کد می‌نویسه، بلکه مسئله حل می‌کنه.",
                  "کار در تیم‌هایی که روحیه یادگیری، احترام و رشد دارند.",
                  "یادگیری دائم و کار روی پروژه‌هایی که تاثیر واقعی دارند."
            ],
            description: "",
      },
      {
            id: 5,
            title: "💪 چه چیزی منو متفاوت می‌کنه؟",
            inner_title: "توانمندی‌های من در یک نگاه",
            list_items: [
                  "شنونده خوبی‌ام، مخصوصاً در محیط تیمی",
                  "تمرکز بالا و روحیه یادگیری دائمی دارم",
                  "به جای اینکه بگم «بلد نیستم»، می‌گم «می‌تونم یاد بگیرم»",
                  "به جزئیات اهمیت می‌دم، چون معتقدم تجربه کاربری توی جزئیاته"
            ],
            description: "",
      },
      {
            id: 6,
            title: "🤝 همکاری ایده‌آل برای من چطوریه؟",
            inner_title: "ترجیح می‌دم با تیم‌هایی کار کنم که:",
            list_items: [
                  "ارتباط سالم و محترمانه دارن",
                  "مسیر مشخص دارن ولی انعطاف‌پذیرن",
                  "یادگیری و رشد در اون‌ها تشویق می‌شه",
                  "کار رو فقط تحویل پروژه نمی‌بینن، بلکه ساخت تجربه براشون مهمه",
            ],
            description: "",
      },
      {
            id: 7,
            title: "🧠 بیرون از کدنویسی چی کار می‌کنم؟",
            inner_title: "عنوان هایی از سرگرمی ها",
            list_items: [
                  "علاقه مند به بازی های ویدیویی مخصوصا شوتینگ",
                  "ورزش کردن در زمان هایی که امکانش رو داشته باشم.",
                  "دیدن سریال و فیلم های مختلف."
            ],
            description: "",
      },
      {
            id: 8,
            title: "📞 اگر حس کردی هم‌مسیر هستیم...",
            inner_title: "",
            list_items: [],
            description: "خوشحال می‌شم بیشتر گپ بزنیم و ببینیم چه فرصت‌هایی می‌تونیم با هم بسازیم.",
      },
]

export default about_me;